/*
문제
Day Of Mourning의 기타리스트 강토는 다가오는 공연에서 연주할 N개의 곡을 연주하고 있다.
지금까지 공연과는 다른 공연을 보여주기 위해서 이번 공연에서는 매번 곡이 시작하기 전에 볼륨을 바꾸고 연주하려고 한다.

먼저, 공연이 시작하기 전에 각각의 곡이 시작하기 전에 바꿀 수 있는 볼륨의 리스트를 만들었다. 
이 리스트를 V라고 했을 때, V[i]는 i번째 곡을 연주하기 전에 바꿀 수 있는 볼륨을 의미한다. 항상 리스트에 적힌 차이로만 볼륨을 바꿀 수 있다.
즉, 현재 볼륨이 P이고 지금 i번째 곡을 연주하기 전이라면, i번 곡은 P+V[i]나 P-V[i] 로 연주해야 한다. 하지만, 0보다 작은 값으로 볼륨을 바꾸거나, M보다 큰 값으로 볼륨을 바꿀 수 없다.

곡의 개수 N과 시작 볼륨 S, 그리고 M이 주어졌을 때, 마지막 곡을 연주할 수 있는 볼륨 중 최댓값을 구하는 프로그램을 작성하시오.
모든 곡은 리스트에 적힌 순서대로 연주해야 한다.

입력
첫째 줄에 N, S, M이 주어진다. (1 ≤ N ≤ 100, 1 ≤ M ≤ 1000, 0 ≤ S ≤ M) 
둘째 줄에는 각 곡이 시작하기 전에 줄 수 있는 볼륨의 차이가 주어진다. 이 값은 1보다 크거나 같고, M보다 작거나 같다.

출력
첫째 줄에 가능한 마지막 곡의 볼륨 중 최댓값을 출력한다. 
만약 마지막 곡을 연주할 수 없다면 (중간에 볼륨 조절을 할 수 없다면) -1을 출력한다.

예제 입력 1
3 5 10
5 3 7
예제 출력 1
10
*/

#include <iostream>
int Q1495_N, Q1495_S, Q1495_M;
int Q1945_list[110];
bool Q1945_dp[110][1010];

int Q1495_solution() {
	//입력
	//곡 개수, 처음 볼륨, 볼륨 최댓값
	std::cin >> Q1495_N >> Q1495_S >> Q1495_M;
	//곡 마다 변경해야하는 +-볼륨
	for (int i = 1; i <= Q1495_N; i++) {
		std::cin >> Q1945_list[i];
	}

	//처음
	Q1945_dp[0][Q1495_S] = true;

	for (int i = 0; i < Q1495_N; i++) {
		int val = Q1945_list[i + 1];
		for (int j = Q1495_M; j >= 0; j--) {
			if (Q1945_dp[i][j]) {
				if (j + val <= Q1495_M) {
					Q1945_dp[i + 1][j + val] = true;
				}
				if (j - val >= 0) {
					Q1945_dp[i + 1][j - val] = true;
				}
			}
		}
	}
	for (int i = Q1495_M; i >= 0; i--) {
		if (Q1945_dp[Q1495_N][i] == true) {
			return i;
		}
	}
	return -1;

}

void Q1495() {
	std::ios::sync_with_stdio(0);
	std::cin.tie(0);
	std::cout << Q1495_solution() << "\n";
}